xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
/**
  ******************************************************************************
  * @file    stm8l1528_eval_glass_lcd.c
  * @author  MCD Application Team
  * @version V2.1.3
  * @date    28-June-2013
  * @brief   This file includes driver for the glass LCD Module mounted on
  *          Big-Falco EVAL board.
  ******************************************************************************
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm8l1528_eval_glass_lcd.h"

/** @addtogroup Utilities
  * @{
  */

/** @defgroup STM8L1528_EVAL_GLASS_LCD
  * @brief This file includes the LCD Glass driver for Pacific Display
  *        (Custom LCD 8x40) Module of Big-Falco-EVAL board.
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/**
  @verbatim
================================================================================
                              GLASS LCD MAPPING
================================================================================
               A
       _  ----------
     P|_| |\   |H  /|
         F| G  |  I |B
          |  \ | /  |
          --M-- --N--
          |   /| \  |
         E|  L |  J |C
       _  | /  |K  \|
     Q|_| -----------
              D

A LCD character coding is based on the following matrix:
             COM0    COM1    COM4    COM5     COM6    COM7
  SEG(n)    { 0 ,     0 ,     I ,     B ,      C ,     J }
  SEG(n+1)  { D ,     K ,     A ,     H ,      M ,     N }
  SEG(n+2)  { Q ,     L ,     G ,     F ,      P ,     E }

The character A for example is:
-----------------------------------------------------------
             COM0    COM1     COM4    COM5    COM6     COM7
  SEG(n)    { 0 ,     0 ,      0 ,     1 ,     1 ,      0 }
  SEG(n+1)  { 0 ,     0 ,      1 ,     0 ,     1 ,      1 }
  SEG(n+2)  { 0 ,     0 ,      0 ,     1 ,     0 ,      1 }
   --------------------------------------------------------
           =  0       0        2       5       3        6 hex

   => 'A' = 0x002536

  @endverbatim
  */

/**
  * @brief LETTERS AND NUMBERS MAPPING DEFINITION
  */
uint16_t i;
CONST uint32_t mask [] =
  {
    0xF00000, 0x0F0000, 0x00F000, 0x000F00, 0x0000F0, 0x00000F
  };
CONST uint8_t shift[6] =
  {
    20, 16, 12, 8, 4, 0
  };

uint8_t digit[6];     /* Digit frame buffer */

/* Letters and number map of the custom LCD 8x40(Big-Falco Evaluation boad) */
CONST uint32_t LetterMap[26] =
  {
    /* A         B         C         D        E          F         G          H         I  */
    0x002536, 0x202536, 0x202404, 0x222310, 0x202426, 0x002426, 0x202416, 0x000536, 0x222200,
    /*  J        K         L         M         N         O         P          Q         R  */
    0x200114, 0x001425, 0x200404, 0x005514, 0x004515, 0x202514, 0x002526, 0x002532, 0x002527,
    /*  S        T         U         V         W         X         Y          Z  */
    0x202432, 0x022200, 0x200514, 0x041404, 0x050515, 0x045001, 0x025000, 0x243000
  };

CONST uint32_t NumberMap[10] =
  {
    /*  0         1          2        3        4   */
    0x202514, 0x000110, 0x202126, 0x202132, 0x000532,
    /*  5         6          7        8        9   */
    0x202432, 0x202436, 0x002110, 0x202536, 0x202532
  };

__IO uint8_t str[7] = "";
/* Private function prototypes -----------------------------------------------*/
static void Convert(uint8_t* c, Point_Typedef Point, DoublePoint_Typedef DoublePoint);
static void delay(__IO uint32_t nCount);
/* Private functions ---------------------------------------------------------*/

/** @defgroup STM8L1528_EVAL_GLASS_LCD_Private_Functions
  * @{
  */

/*  * @brief  Configures the LCD GLASS GPIO port IOs and LCD peripheral.
  * @param  None
  * @retval None
  */

void LCD_GLASS_Init(void)
{
  /*
    The LCD is configured as follow:
     - clock source = LSE (32.768 KHz)
     - Voltage source = Internal
     - Prescaler = 2
     - Divider = 18 (16 + 2)  
     - Mode = 1/8 Duty, 1/4 Bias
     - LCD frequency = (clock source * Duty) / (Prescaler * Divider)
                     = 114 Hz ==> Frame frequency = 28,5 Hz*/


  /* Enable LCD clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_LCD, ENABLE);
  CLK_RTCClockConfig(CLK_RTCCLKSource_LSE, CLK_RTCCLKDiv_1);

  /* Initialize the LCD */
  LCD_Init(LCD_Prescaler_2, LCD_Divider_18, LCD_Duty_1_8,
           LCD_Bias_1_4, LCD_VoltageSource_Internal);

  /* Mask register*/
  LCD_PortMaskConfig(LCD_PortMaskRegister_0, 0xFF);
  LCD_PortMaskConfig(LCD_PortMaskRegister_1, 0xFF);
  LCD_PortMaskConfig(LCD_PortMaskRegister_2, 0xFF);
  LCD_PortMaskConfig(LCD_PortMaskRegister_3, 0xFF);
  LCD_PortMaskConfig(LCD_PortMaskRegister_4, 0xFF);
  LCD_PortMaskConfig(LCD_PortMaskRegister_5, 0x0F);

  LCD_ContrastConfig(LCD_Contrast_Level_7);

  LCD_PulseOnDurationConfig(LCD_PulseOnDuration_7);

  LCD_Cmd(ENABLE); /*!< Enable LCD peripheral */
}

/**
  * @brief  This function writes a char on the LCD Glass.
  * @param  ch: the character to dispaly.
  * @param  point: a point to add in front of char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param  DoublePoint: flag indicating if a double point has to be added in front
  *         of the displayed character.
  *         This parameter can be: DOUBLEPOINT_OFF or DOUBLEPOINT_ON.
  * @param  position: position in the LCD of the character to write [0:6]
  * @retval None
  */
void LCD_GLASS_WriteChar(uint8_t* ch, Point_Typedef Point,
                         DoublePoint_Typedef DoublePoint, uint8_t Position)
{
  Convert(ch, Point, DoublePoint);
  /* Enable the write access on the LCD RAM first banck */
  LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
  switch (Position)
  {
      /* Position 0 on LCD (Digit1)*/
    case 0:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      /*Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFB;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)(digit[0] << (uint8_t)0x01);

