xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
      /*Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)(digit[1] << (uint8_t)0x05);

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      /*Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xF1;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)(digit[2] << (uint8_t)0x01);

      /*Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0x1F;
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)(digit[3] << (uint8_t)0x05);

      /*Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0xF9;
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)(digit[4] << (uint8_t)0x01);

      /*Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0x1F;
      LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)(digit[5] << (uint8_t)0x05);
      break;

      /* Position 1 on LCD */
    case 1:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      /*Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x9F;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)(digit[0] << (uint8_t)0x04);

      /*Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xF9;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)(digit[1]);

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;
      /*Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x8F;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)(digit[2] << (uint8_t)0x04);

      /*Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xF8;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)(digit[3]);

      /*Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0x8F;
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)(digit[4] << (uint8_t)0x04);

      /*Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0xF8;
      LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)(digit[5]);
      break;

      /* Position 2 on LCD (Digit3)*/
    case 2:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      /*Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)((digit[0] & (uint8_t)0x01) << (uint8_t)0x07);
      LCD->RAM[LCD_RAMRegister_2] |= (uint8_t)((digit[0] & (uint8_t)0x06) >> (uint8_t)0x01);

      /*Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xCF;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)(digit[1] << (uint8_t)0x03);

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;
      /*Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)((digit[2] & (uint8_t)0x1) << (uint8_t)0x07);
      LCD->RAM[LCD_RAMRegister_2] |= (uint8_t)((digit[2] & (uint8_t)0x6) >> (uint8_t)0x01);

      /*Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xC7;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)(digit[3] << (uint8_t)0x03);

      /*Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_9] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)((digit[4] & (uint8_t)0x1) << (uint8_t)0x07);
      LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)((digit[4] & (uint8_t)0x6) >> (uint8_t)0x01);
      /*Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0xC7;
      LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)(digit[5] << (uint8_t)0x03);
      break;

      /* Position 3 on LCD */
    case 3:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      /*Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xE7;
      LCD->RAM[LCD_RAMRegister_2] |= (uint8_t)(digit[0] << (uint8_t)0x02);

      /*Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_6] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)((digit[1] & (uint8_t)0x03) << (uint8_t)0x06);
      LCD->RAM[LCD_RAMRegister_6] |= (uint8_t)((digit[1] & (uint8_t)0x04) >> (uint8_t)0x02);

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      /*Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xE3;
      LCD->RAM[LCD_RAMRegister_2] |= (uint8_t)(digit[2] << (uint8_t)0x02);

      /*Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_6] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)((digit[3] & (uint8_t)0x3) << (uint8_t)0x06);
      LCD->RAM[LCD_RAMRegister_6] |= (uint8_t)((digit[3] & (uint8_t)0x4) >> (uint8_t)0x02);

      /*Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_9] &= (uint8_t)0xE3;
      LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)(digit[4] << (uint8_t)0x02);

      /*Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_13] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)((digit[5] & (uint8_t)0x3) << (uint8_t)0x06);
      LCD->RAM[LCD_RAMRegister_13] |= (uint8_t)((digit[5] & (uint8_t)0x4) >> (uint8_t)0x02);
      break;

      /* Position 4 on LCD (Digit5)*/
    case 4:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      /*Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xF9;
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)(digit[0]);

      /*Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x9F;
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)(digit[1] << (uint8_t)0x4);

