xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xC7;
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_9] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0xC7;

      break;

      /* Position 3 on LCD Glass*/
    case 3:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xE7;
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_6] &= (uint8_t)0xFE;

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xE3;
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_6] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_9] &= (uint8_t)0xE3;
      LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_13] &= (uint8_t)0xFE;

      break;

      /* Position 4 on LCD Glass*/
    case 4:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xF9;
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x9F;

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xF8;
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x8F;
      LCD->RAM[LCD_RAMRegister_7] &= (uint8_t)0xF8;
      LCD->RAM[LCD_RAMRegister_10] &= (uint8_t)0x8F;

      break;

      /* Position 5 on LCD Glass*/
    case 5:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xCF;
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0xFF;
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xFC;

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xC7;
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xFC;
      LCD->RAM[LCD_RAMRegister_7] &= (uint8_t)0xC7;
      LCD->RAM[LCD_RAMRegister_10] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0xFC;

      break;

      /* Position 6 on LCD Glass*/
    case 6:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0x7F;
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xE7;

      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;

      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xE3;
      LCD->RAM[LCD_RAMRegister_7] &= (uint8_t)0x3F;
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0xFE;
      LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0xE3;

      break;

    default:
      break;
  }
}
/**
  * @brief  This function Clears the LCD Glass Text Zone.
  * @param  None
  * @retval None
  */
void LCD_GLASS_ClearTextZone(void)
{
  /* Enable the write access on the LCD RAM First banck */
  LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

  LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFB;
  LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0x3F;
  LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x9F;
  LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xF9;
  LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFF;
  LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xCF;
  LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xE7;
  LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_6] &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xF9;
  LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x9F;
  LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xCF;
  LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0xFF;
  LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xE7;

  /* Enable the write access on the LCD RAM second banck */
  LCD->CR4 |= LCD_CR4_PAGECOM;

  LCD->RAM[LCD_RAMRegister_1]  &= (uint8_t)0xF1;
  LCD->RAM[LCD_RAMRegister_4]  &= (uint8_t)0x1F;
  LCD->RAM[LCD_RAMRegister_8]  &= (uint8_t)0xF9;
  LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0x1F;
  LCD->RAM[LCD_RAMRegister_1]  &= (uint8_t)0x8F;
  LCD->RAM[LCD_RAMRegister_5]  &= (uint8_t)0xF8;
  LCD->RAM[LCD_RAMRegister_8]  &= (uint8_t)0x8F;
  LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0xF8;
  LCD->RAM[LCD_RAMRegister_1]  &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_2]  &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_5]  &= (uint8_t)0xC7;
  LCD->RAM[LCD_RAMRegister_8]  &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_9]  &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0xC7;
  LCD->RAM[LCD_RAMRegister_2]  &= (uint8_t)0xE3;
  LCD->RAM[LCD_RAMRegister_5]  &= (uint8_t)0x3F;
  LCD->RAM[LCD_RAMRegister_6]  &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_9]  &= (uint8_t)0xE3;
  LCD->RAM[LCD_RAMRegister_12] &= (uint8_t)0x3F;
  LCD->RAM[LCD_RAMRegister_13] &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_0]  &= (uint8_t)0xF8;
  LCD->RAM[LCD_RAMRegister_3]  &= (uint8_t)0x8F;
  LCD->RAM[LCD_RAMRegister_7]  &= (uint8_t)0xF8;
  LCD->RAM[LCD_RAMRegister_10] &= (uint8_t)0x8F;
  LCD->RAM[LCD_RAMRegister_0]  &= (uint8_t)0xC7;
  LCD->RAM[LCD_RAMRegister_3]  &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_4]  &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_7]  &= (uint8_t)0xC7;
  LCD->RAM[LCD_RAMRegister_10] &= (uint8_t)0x7F;
  LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0xFC;
  LCD->RAM[LCD_RAMRegister_0]  &= (uint8_t)0x3F;
  LCD->RAM[LCD_RAMRegister_1]  &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_4]  &= (uint8_t)0xE3;
  LCD->RAM[LCD_RAMRegister_7]  &= (uint8_t)0x3F;
  LCD->RAM[LCD_RAMRegister_8]  &= (uint8_t)0xFE;
  LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0xE3;

