xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
}
/**
  * @brief  This function Clears the LCD display memory.
  * @param  None
  * @retval None
  */
void LCD_GLASS_Clear(void)
{
  uint8_t counter = 0x00;

  /* Enable the write access on the LCD RAM First banck */
  LCD->CR4 &= (uint8_t)(~LCD_CR4_PAGECOM);

  for (counter = 0x0; counter < 0x16; counter++)
  {
    LCD->RAM[counter] =  LCD_RAM_RESET_VALUE;
  }

  /* Enable the write access on the LCD RAM second banck */
  LCD->CR4 |= LCD_CR4_PAGECOM;

  for (counter = 0x0; counter < 0x16; counter++)
  {
    LCD->RAM[counter] =  LCD_RAM_RESET_VALUE;
  }
}

/**
  * @brief  Writes a String on the LCD Glass.
  * @param  ptr: Pointer to the string to display on the LCD Glass.
  * @retval None
  */
void LCD_GLASS_DisplayString(uint8_t* ptr)
{
  uint8_t i = 0x00;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (i < 8))
  {
    /* Display one character on LCD */
    LCD_GLASS_WriteChar(ptr, (Point_Typedef)0, (DoublePoint_Typedef)0, i);

    /* Point to the next character */
    ptr++;

    /* Increment the character counter */
    i++;
  }
}
/**
  * @brief  Display a string in scrolling mode
  * @param  ptr: Pointer to the string to display on the LCD Glass.
  * @param  nScroll: Specifies how many time the message will be scrolled
  * @param  ScrollSpeed : Specifies the speed of the scroll, lower value gives
  *         higher speed
  * @retval None
  */
void LCD_GLASS_ScrollString(uint8_t* ptr, uint32_t nScroll, uint32_t ScrollSpeed)
{
  uint8_t Position   = 0;
  uint8_t Repetition = 0;
  uint8_t* ptr1;

  ptr1 = ptr;

  LCD_GLASS_DisplayString(ptr1);

  delay(ScrollSpeed);

  for (Repetition = 0; Repetition < nScroll; Repetition++)
  {
    *(str + 1) = *ptr1;
    *(str + 2) = *(ptr1 + 1);
    *(str + 3) = *(ptr1 + 2);
    *(str + 4) = *(ptr1 + 3);
    *(str + 5) = *(ptr1 + 4);
    *(str + 6) = *(ptr1 + 5);
    *(str) = *(ptr1 + 6);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 6);
    *(str + 2) = *ptr1;
    *(str + 3) = *(ptr1 + 1);
    *(str + 4) = *(ptr1 + 2);
    *(str + 5) = *(ptr1 + 3);
    *(str + 6) = *(ptr1 + 4);
    *(str) = *(ptr1 + 5);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 5);
    *(str + 2) = *(ptr1 + 6);
    *(str + 3) = *ptr1;
    *(str + 4) = *(ptr1 + 1);
    *(str + 5) = *(ptr1 + 2);
    *(str + 6) = *(ptr1 + 3);
    *(str) = *(ptr1 + 4);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 4);
    *(str + 2) = *(ptr1 + 5);
    *(str + 3) = *(ptr1 + 6);
    *(str + 4) = *ptr1;
    *(str + 5) = *(ptr1 + 1);
    *(str + 6) = *(ptr1 + 2);
    *(str) = *(ptr1 + 3);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 3);
    *(str + 2) = *(ptr1 + 4);
    *(str + 3) = *(ptr1 + 5);
    *(str + 4) = *(ptr1 + 6);
    *(str + 5) = *ptr1;
    *(str + 6) = *(ptr1 + 1);
    *(str) = *(ptr1 + 2);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 2);
    *(str + 2) = *(ptr1 + 3);
    *(str + 3) = *(ptr1 + 4);
    *(str + 4) = *(ptr1 + 5);
    *(str + 5) = *(ptr1 + 6);
    *(str + 6) = *ptr1;
    *(str) = *(ptr1 + 1);
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);

    *(str + 1) = *(ptr1 + 1);
    *(str + 2) = *(ptr1 + 2);
    *(str + 3) = *(ptr1 + 3);
    *(str + 4) = *(ptr1 + 4);
    *(str + 5) = *(ptr1 + 5);
    *(str + 6) = *(ptr1 + 6);
    *(str) = *ptr1;
    for (Position = 1 ; Position <= 7;Position++)
    {
      LCD_GLASS_ClearChar( Position);
    }
    LCD_GLASS_DisplayString((uint8_t*)str);
    delay(ScrollSpeed);
  }
}

/**
  ** @brief Configure ST Logo display.
  * @param NewState: enable or disable the logo display .
  * @retval None
  */
void LCD_GLASS_DisplayLogo(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    /* Enable the write access on the LCD RAM First banck */
    LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;

    /* Set logo on  */
    LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x40;
  }
  else
  {
    /* Enable the write access on the LCD RAM First banck */
    LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
    /* Set logo of  */
    LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xBF;
  }
}

/**
  ** @brief Configure the LCD Battery Level.
  * @param BatteryLevel: Specify the Battery Level to set.
  * @retval None
  */
void LCD_GLASS_BatteryLevelConfig(BatteryLevel_TypeDef BatteryLevel)
{

  switch (BatteryLevel)
  {
      /* BATTERYLEVEL 1/4 */
    case BATTERYLEVEL_1_4:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set BATTERYLEVEL_1_4  on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x01;
      break;

      /* BATTERYLEVEL 1/2 )*/
    case BATTERYLEVEL_1_2:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set BatteryLevel_1_4 on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x01;
      /* Set BatteryLevel_1_2 on  */
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)0x10;
      break;

      /* Battery Level 3/4*/
    case BATTERYLEVEL_3_4:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set BATTERYLEVEL_1_4  on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x01;
      /* Set BATTERYLEVEL_1_2  on  */
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)0x10;
      /* Set BATTERYLEVEL_3_4  on  */
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)0x80;
      break;

