xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
      /* BATTERYLEVEL_FULL*/
    case BATTERYLEVEL_FULL:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set BATTERYLEVEL_1_4 on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x01;
      /* Set BATTERYLEVEL_1_2 on  */
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)0x10;
      /* Set BATTERYLEVEL_3_4 on  */
      LCD->RAM[LCD_RAMRegister_3] |= (uint8_t)0x80;
      /* Set BATTERYLEVEL_FULL on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint8_t)0x08;
      break;

    case BATTERYLEVEL_OFF:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set BATTERYLEVEL_1_4 off  */
      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xFE;
      /* Set BATTERYLEVEL_1_2 off  */
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0xEF;
      /* Set BATTERYLEVEL_3_4 off  */
      LCD->RAM[LCD_RAMRegister_3] &= (uint8_t)0x7F;
      /* Set BATTERYLEVEL_FULL off  */
      LCD->RAM[LCD_RAMRegister_0] &= (uint8_t)0xF7;
      break;

    default:
      break;
  }


}

/**
  ** @brief Configure the LCD ArrowDirection.
  * @param Arrow: Specify the ArrowDirection to set.
  * @retval None
  */
void LCD_GLASS_ArrowConfig(ArrowDirection_TypeDef ArrowDirection)
{

  switch (ArrowDirection)
  {
      /* ARROWDIRECTION_UP*/
    case ARROWDIRECTION_UP:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set ARROWDIRECTION_UP on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x10;
      break;

      /* ARROWDIRECTION_LEFT*/
    case ARROWDIRECTION_LEFT :
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set ARROWDIRECTION_LEFT on  */
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)0x01;
      break;

      /* ARROWDIRECTION_DOWN*/
    case ARROWDIRECTION_DOWN:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set ARROWDIRECTION_DOWN on  */
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)0x08;
      break;

      /* ARROWDIRECTION_RIGHT*/
    case ARROWDIRECTION_RIGHT:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set ARROWDIRECTION_RIGHT on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x80;
      break;

    case ARROWDIRECTION_OFF:
      /* Enable the write access on the LCD RAM second banck */
      LCD->CR4 |= LCD_CR4_PAGECOM;
      /* Set ARROWDIRECTION_UP of  */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xEF;
      /* Set ARROWDIRECTION_LEFT of  */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xFE;
      /* Set ARROWDIRECTION_DOWN of  */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xF7;
      /* Set ARROWDIRECTION_RIGHT of  */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0x7F;
      break;

    default:
      break;
  }


}

/**
  ** @brief Configure the LCD Temperature level display .
  * @param Temperature: indicate the Temperature level to set.
  * @param NewState: enable or desable the digit.
  * @retval None
  */
void LCD_GLASS_TemperatureConfig(TemperatureLevel_TypeDef Temperature)
{
  switch (Temperature)
  {
      /* Temp_6*/
    case TEMPERATURELEVEL_6 :
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x20;
      break;

      /* Temperature_5)*/
    case TEMPERATURELEVEL_5:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x20;
      /* Set Temperature_5 on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x02;
      break;

      /* Temperature_4*/
    case TEMPERATURELEVEL_4:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x20;
      /* Set Temperature_5 on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x02;
      /* Set Temperature_4 on  */
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x04;
      break;
      /* Temperature_3*/
    case TEMPERATURELEVEL_3:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x20;
      /* Set Temperature_5 on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x02;
      /* Set Temperature_4 on  */
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x04;
      /* Set Temperature_3 on  */
      LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x40;
      break;

      /* Temperature_2*/
    case TEMPERATURELEVEL_2:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4]  |= (uint8_t)0x20;
      /* Set Temperature_5 on  */
      LCD->RAM[LCD_RAMRegister_1]  |= (uint8_t)0x02;
      /* Set Temperature_4 on  */
      LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x40;
      /* Set Temperature_3 on  */
      LCD->RAM[LCD_RAMRegister_8]  |= (uint8_t)0x04;
      /* Set Temperature_1 on  */
      LCD->RAM[LCD_RAMRegister_8]  |= (uint8_t)0x08;
      break;

      /* Temperature_1*/
    case  TEMPERATURELEVEL_1:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x20;
      /* Set Temperature_5 on  */
      LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x02;
      /* Set Temperature_4 on  */
      LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x40;
      /* Set Temperature_3 on  */
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x04;
      /* Set Temperature_2 on  */
      LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x08;
      /* Set Temperature_3 on  */
      LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x80;
      break;


    case TEMPERATURELEVEL_OFF:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set Temperature_6 off  */
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xDF;
      /* Set Temperature_5 off  */
      LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xFD;
      /* Set Temperature_4 off  */
      LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0xBF;
      /* Set Temperature_3 off */
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0xFB;
      /* Set Temperature_2 off  */
      LCD->RAM[LCD_RAMRegister_11] &= (uint8_t)0x7F;
      /* Set Temperature_1 off  */
      LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0xF7;
      break;

    default:
      break;
  }


