xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
}

/**
  ** @brief Configure the LCD ValueUnit.
  * @param ValueUnite: indicate the ValueUnit to set.
  * @param NewState: enable or desable the digit.
  * @retval None
  */
void LCD_GLASS_ValueUnitConfig(ValueUnit_TypeDef ValueUnit)
{

  switch (ValueUnit)
  {
      /* VALUEUNIT MILLIAMPERE*/
    case VALUEUNIT_MILLIAMPERE:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set VALUEUNIT_MILLIAMPERE on  */
      LCD->RAM[LCD_RAMRegister_5] |= (uint8_t)0x40;
      break;

      /* VALUEUNIT MICROAMPERE)*/
    case VALUEUNIT_MICROAMPERE:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set VALUEUNIT_MICROAMPERE  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint8_t)0x04;
      break;

      /* VALUEUNIT NANOAMPERE*/
    case  VALUEUNIT_NANOAMPERE:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set VALUEUNIT_NANOAMPERE on  */
      LCD->RAM[LCD_RAMRegister_4] |= (uint8_t)0x04;
      break;

    case  VALUEUNIT_OFF:
      /* Enable the write access on the LCD RAM First banck */
      LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
      /* Set VALUEUNIT_MILLIAMPERE off  */
      LCD->RAM[LCD_RAMRegister_5] &= (uint8_t)0xBF;
      /* Set VALUEUNIT_MICROAMPERE off  */
      LCD->RAM[LCD_RAMRegister_2] &= (uint8_t)0xFB;
      /* Set VALUEUNIT_NANOAMPERE off  */
      LCD->RAM[LCD_RAMRegister_4] &= (uint8_t)0xFB;
      break;

    default:
      break;
  }


}

/**
  * @brief Configure the LCD sign.
  * @param Signe: indicate the sign to set.
  * @param NewState: enable or disable the digit.
  * @retval None
  */
void LCD_GLASS_SignCmd(Sign_TypeDef Sign, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    switch (Sign)
    {
        /* Signe positive */
      case SIGN_POSITIVE:
        /* Enable the write access on the LCD RAM second banck */
        LCD->CR4 |= LCD_CR4_PAGECOM;
        /* Set SIGN_POSITIVE on  */
        LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x08;
        break;

        /* Signe negative*/
      case SIGN_NEGATIVE:
        /* Enable the write access on the LCD RAM First banck */
        LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
        /* Set SIGN_NEGATIVE on  */
        LCD->RAM[LCD_RAMRegister_1] |= (uint8_t)0x08;
        break;

      default:
        break;
    }
  }
  else
  {
    /* Enable the write access on the LCD RAM second banck */
    LCD->CR4 |= LCD_CR4_PAGECOM;
    /* Set SIGN_POSITIVE off  */
    LCD->RAM[LCD_RAMRegister_8] &= (uint8_t)0xF7;
    /* Enable the write access on the LCD RAM second banck */
    LCD->CR4 |= LCD_CR4_PAGECOM;
    /* Set SICN_NEGATIVE off  */
    LCD->RAM[LCD_RAMRegister_1] &= (uint8_t)0xF7;
  }
}
/**
  * @brief Set Matrix Pixel on.
  * @param PixelRow: Specify Matrix Row.
  * @param PixelColumn: Specify Matrix Column.
  * @retval None
  */
void LCD_GLASS_WriteMatrixPixel(PixelRow_TypeDef PixelRow, PixelColumn_TypeDef PixelColumn)
{
  switch (PixelRow)
  {
    case PIXELROW_1:

      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x20;
          break;

        case PIXELCOLUMN_2:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x04;
          break;

        case PIXELCOLUMN_3:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x02;
          break;

        case PIXELCOLUMN_4:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x01;
          break;

        case PIXELCOLUMN_5:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x20;
          break;

        case PIXELCOLUMN_6:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x10;
          break;

        case PIXELCOLUMN_7:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x08;
          break;

        case PIXELCOLUMN_8:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_13] |= (uint8_t)0x01;
          break;

        case PIXELCOLUMN_9:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 9 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x80;
          break;

        case PIXELCOLUMN_10:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 10 */
          LCD->RAM[LCD_RAMRegister_12] |= (uint8_t)0x40;
          break;

        case PIXELCOLUMN_11:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 11 */
          LCD->RAM[LCD_RAMRegister_10] |= (uint8_t)0x40;
          break;

        case PIXELCOLUMN_12:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 12 */
          LCD->RAM[LCD_RAMRegister_10] |= (uint8_t)0x20;
          break;

