xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
        case PIXELCOLUMN_13:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 13 */
          LCD->RAM[LCD_RAMRegister_10] |= (uint8_t)0x10;
          break;

        case PIXELCOLUMN_14:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 14 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x02;
          break;

        case PIXELCOLUMN_15:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 15 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x01;
          break;

        case PIXELCOLUMN_16:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 16 */
          LCD->RAM[LCD_RAMRegister_10] |= (uint8_t)0x80;
          break;

        case PIXELCOLUMN_17:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 17 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x10;
          break;

        case PIXELCOLUMN_18:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 18 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x08;
          break;

        case PIXELCOLUMN_19:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 1 , Column = 19 */
          LCD->RAM[LCD_RAMRegister_11] |= (uint8_t)0x04;
          break;

        default:
          break;

      }
      break;
    case PIXELROW_2:

      switch ( PixelColumn)
      {
        case  PIXELCOLUMN_1:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x02;
          break;

        case  PIXELCOLUMN_2:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x40;
          break;

        case  PIXELCOLUMN_3:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x20;
          break;

        case  PIXELCOLUMN_4:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row =  2 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x10;
          break;

        case  PIXELCOLUMN_5:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)0x02;
          break;

        case  PIXELCOLUMN_6:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)0x01;
          break;

        case  PIXELCOLUMN_7:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x80;
          break;

        case  PIXELCOLUMN_8:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)0x10;
          break;

        case  PIXELCOLUMN_9:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 9*/
          LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)0x08;
          break;

        case  PIXELCOLUMN_10:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 10*/
          LCD->RAM[LCD_RAMRegister_9] |= (uint8_t)0x04;
          break;

        case  PIXELCOLUMN_11:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 11 */
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x04;
          break;

        case PIXELCOLUMN_12:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 12 */
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x02;
          break;

        case  PIXELCOLUMN_13:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 13*/
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x01;
          break;

        case  PIXELCOLUMN_14:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 14*/
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x20;
          break;

        case  PIXELCOLUMN_15:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 15 */
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x10;
          break;

        case  PIXELCOLUMN_16:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 16*/
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x08;
          break;

        case  PIXELCOLUMN_17:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 17*/
          LCD->RAM[LCD_RAMRegister_8] |= (uint8_t)0x01;
          break;

        case  PIXELCOLUMN_18:
          /* Enable the write access on the LCD RAM First banck */
          LCD->CR4 &= (uint8_t)~LCD_CR4_PAGECOM;
          /* Position : Row = 2 , Column = 18 */
          LCD->RAM[LCD_RAMRegister_7] |= (uint8_t)0x80;
          break;

