xhawk18/s_task/projects/stm8l05x/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib/Utilities/STM8_EVAL/STM8L1528_EVAL/stm8l1528_eval_glass_lcd.c
        case PIXELCOLUMN_8:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 8 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xFE;
          break;

        case PIXELCOLUMN_9:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 9 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xFD;
          break;

        case PIXELCOLUMN_10:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 10 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xFB;
          break;

        case PIXELCOLUMN_11:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 11 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xF7;
          break;

        case PIXELCOLUMN_12:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 12 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xEF;
          break;

        case PIXELCOLUMN_13:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 13 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xDF;
          break;

        case PIXELCOLUMN_14:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 14 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0xBF;
          break;

        case PIXELCOLUMN_15:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 15 */
          LCD->RAM[LCD_RAMRegister_14] &= (uint8_t)0x7F;
          break;

        case PIXELCOLUMN_16:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 16 */
          LCD->RAM[LCD_RAMRegister_15] &= (uint8_t)0xFE;
          break;

        case PIXELCOLUMN_17:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 17 */
          LCD->RAM[LCD_RAMRegister_15] &= (uint8_t)0xFD;
          break;

        case PIXELCOLUMN_18:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 18 */
          LCD->RAM[LCD_RAMRegister_15] &= (uint8_t)0xFB;
          break;

        case PIXELCOLUMN_19:
          /* Enable the write access on the LCD RAM second banck */
          LCD->CR4 |= LCD_CR4_PAGECOM;
          /* Position : Row = 10, Column = 19 */
          LCD->RAM[LCD_RAMRegister_15] &= (uint8_t)0xF7;
          break;

        default:
          break;
      }
      break;
  }

}
/**
  * @brief  Converts an ascii char to the a LCD digit (previous coding).
  * @param  c: a char to display.
  * @param  Point: a point to add in front of a char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param  DoublePoint: flag indicating if Double Point has to be added in front
  *         of the displayed character.
  *         This parameter can be: DOUBLEPOINT_ON or DOUBLEPOINT_OFF.
  * @retval None
  */
static void Convert(uint8_t* c, Point_Typedef Point, DoublePoint_Typedef DoublePoint)
{
  uint32_t ch = 0 , tmp = 0;
  uint16_t i;

  /* The character c is a letter in upper case*/
  if ((*c < (uint8_t)0x5B)&(*c > (uint8_t)0x40))
  {
    ch = LetterMap[*c-(uint8_t)0x41];
  }
  /* The character c is a number*/
  if ((*c < (uint8_t)0x3A)&(*c > (uint8_t)0x2F))
  {
    ch = NumberMap[*c-(uint8_t)0x30];
  }
  /* The character c is a space character */
  if (*c == (uint8_t)0x20)
  {
    ch = (uint8_t)0x00;
  }
  /* Set the Q pixel in the character that can be displayed if the point is on */
  if (Point == POINT_ON)
  {
    ch |= (uint8_t)0x400000;
  }

  /* Set the P pixel in the character that can be displayed if the double point is on */
  if (DoublePoint == DOUBLEPOINT_ON)
  {
    ch |= (uint8_t)0x000040;
  }

  for (i = 0;i < 6; i++)
  {
    tmp = ch & mask[i];
    digit[i] = (uint8_t)(tmp >> (uint8_t)shift[i]);
  }
}
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0;
  for (index = (0x60 * nCount); index != 0; index--)
  {}
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
